CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
enum Month
{
    _JAN = 1,
    _FEB = 2,
    _MAR = 3,
    _APR = 4,
    _MAY = 5,
    _JUN = 6,
    _JUL = 7,
    _AUG = 8,
    _SEP = 9,
    _OCT = 10,
    _NOV = 11,
    _DEC = 12

};

int current_year, current_month = 0;

JsonDocument current_sensor_data;
bool time_to_send_telemetry = false;
bool is_boot_telemetry = false;
void setup()
{
    Serial.begin(115200);
    boottime = millis();
    DeviceConfigState.state = CONFIG_BOOT_INIT;

    uint64_t chipid_num;
    chipid_num = ESP.getEfuseMac();
    snprintf(esp_chipid, sizeof(esp_chipid), "%llX", chipid_num);
    delay(3000);
    Serial.print("ESP32 Chip ID: ");
    Serial.println(esp_chipid);
    strcpy(ROOT_DIR, "/");
    strcat(ROOT_DIR, SENSOR_PREFIX); //? Refactor to copy AP_SSID if it remains unchanged
    strcat(ROOT_DIR, esp_chipid);

    strcat(MQTT_TELEMETRY_TOPIC, MQTT_BASE_TOPIC);
    strcat(MQTT_TELEMETRY_TOPIC, "/");
    strcat(MQTT_TELEMETRY_TOPIC, SENSOR_PREFIX);
    strcat(MQTT_TELEMETRY_TOPIC, esp_chipid);
    // Set Dual Access Point and Station WiFi mode
    WiFi.mode(WIFI_AP_STA); // ToDo: Configure this when not on power saving mode.
    strcat(AP_SSID, SENSOR_PREFIX);
    strcat(AP_SSID, esp_chipid);

    init_memory_loggers();
    Serial.println("Initializing PMS5003 sensor");
    pms.init();
    delay(2000);
    pms.sleep();
    dht.setType(DHTTYPE);

    loadInitialConfigs(); // from global config file after compilation

    if (!LittleFS.begin(true))
    {
        Serial.println("An error has occurred while mounting LittleFS");
    }
    else
    {
        Serial.println("LittleFS mounted successfully");

        // Step 1: Load existing config from LittleFS // ToDo: Refactor this to a function and call it in the captive portal flow as well after user submits config form. This is to ensure that we always have the latest config in memory, especially after user updates it via captive portal.
        String existingConfig = readFile(LittleFS, "/config.json");
        if (existingConfig != "" && validateJson(existingConfig.c_str()))
        {
            Serial.println(existingConfig);
            DeviceConfigState.configurationRequired = false;
        }
        else
        {
            DeviceConfigState.configurationRequired = true;
        }
    }

    // Device configuration

    if (DeviceConfigState.configurationRequired)
    {
        // Step 2: Start WiFi AP
        WiFi.softAP(AP_SSID, AP_PWD);
        Serial.print("struct_wifiInfo* wifiInfo size: ");
        Serial.println(max_wifi_hotspots_size);

        wifi_networks_scan(wifiInfo, count_wifiInfo);

        // Step 3: Start Captive Portal & Web Server
        DeviceConfigState.state = CONFIG_CAPTIVE_PORTAL_ACTIVE;
        DeviceConfigState.captivePortalStartTime = millis();
        DeviceConfigState.captivePortalTimeoutMs = 5 * 60 * 1000; // 5 minutes
        // DNS server for captive portal
        dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
        setup_webserver();

        // ToDO: Do not start captival portal if configs are valid
        // ToDo: This should probably be spinned in another core
        startCaptivePortal(DeviceConfigState.captivePortalAccessed, DeviceConfigState.captivePortalStartTime, DeviceConfigState.captivePortalTimeoutMs);
    }

    // ToDo: go ahead and apply device configs. Check the default power saving mode and set default configs.
    loadSavedDeviceConfigs(); // Override initial configs

    WiFi.softAP(AP_SSID, AP_PWD); // start AP & webserver anyway
    setup_webserver();

    initComms();

// SD INIT
#ifdef REASSIGN_PINS
    SPI.begin(SD_SCK, SD_MISO, SD_MOSI, SD_CS);
    if (SD_Init(SD_CS))
    {
#else
    if (SD_Init(-1))
    {
#endif

        SD_Attached = SDattached();
        DeviceConfigState.sdCardInitialized = SD_Attached;

        if (SD_Attached)
        {
            init_SD_loggers();
        }
    }
    else
    {
        DeviceConfigState.sdCardInitialized = false;
    }

    buildDeviceInfoJSON();
    starttime = millis();
}

// ToDo: introduce ESP light sleep mode
void loop()
{
#if defined(SERIAL_DEBUG) && SERIAL_DEBUG
    listenSerial();
#endif

    // Manage communication device and connectivity state
    commsManager();

    act_milli = millis();

    if (DeviceConfig.power_saving_mode)
    {
        if (act_milli - last_read_sensors_data > sampling_interval && !send_now) // only send data after the memory logger is full
        {
            getPMSREADINGS();
            readDHT();
            last_read_sensors_data = millis();
        }
    }
    else
    {
        send_now = act_milli - starttime > sending_intervall_ms;

        if (act_milli - last_read_sensors_data > sampling_interval)
        {
            getPMSREADINGS();
            readDHT();
            last_read_sensors_data = millis();
        }
    }

    if (send_now && CommsManagerState.preferredComm != CommsManagerState.PreferredComm::NONE)
    {

        // Send data from memory loggers
        sendFromMemoryLog(JSON_PAYLOAD_LOGGER);
        // send payloads from the files that stores data that failed posting previously
        readSendDelete(SENSORS_FAILED_DATA_SEND_STORE_PATH);

        if (DeviceConfigState.gsmConnected && DeviceConfigState.gsmInternetAvailable)
        {
            GSM_sleep();
        }

        starttime = millis();
    }

    if (DeviceConfigState.isMQTTConfigured)
    {
        // Check if setup is complete and we haven't sent boot telemetry yet
        if (!boot_telemetry_sent && !DeviceConfigState.configurationRequired && millis() - boottime > BOOT_TELEMETRY_DELAY_MS)
        {
            time_to_send_telemetry = true;
            is_boot_telemetry = true;
            Serial.println("Time for boot telemetry send");
        }
        // Check if it's time for regular interval-based telemetry
        else if (millis() - last_send_telemetry > SEND_TELEMETRY_INTERVAL_MS)
        {
            time_to_send_telemetry = true;
            Serial.println("Time for regular interval telemetry send");
        }

