CodeForAfrica/sensors.AFRICA-ESP32-Quectel-Firmware/src/main.cpp
String formatDateTime(time_t t, String timezone)
{
    String yearStr = String(year(t)); // Adjust year back to 20xx
    String monthStr = String(month(t));
    String dayStr = String(day(t));
    String hourStr = String(hour(t));
    String minuteStr = String(minute(t));
    String secondStr = String(second(t));

    // Pad with leading zeros if necessary
    if (monthStr.length() == 1)
        monthStr = "0" + monthStr;
    if (dayStr.length() == 1)
        dayStr = "0" + dayStr;
    if (hourStr.length() == 1)
        hourStr = "0" + hourStr;
    if (minuteStr.length() == 1)
        minuteStr = "0" + minuteStr;
    if (secondStr.length() == 1)
        secondStr = "0" + secondStr;

    return yearStr + "-" + monthStr + "-" + dayStr + "T" + hourStr + ":" + minuteStr + ":" + secondStr + timezone;
}

String getRTCdatetimetz(const char *format, char *timezone)
{
    String datetimetz = RTC.getTime(format);
    datetimetz += timezone;
    return datetimetz;
}

/*****************************************************************
 * send data via WiFi                                            *
 *****************************************************************/
/**
    @brief: Send data to the server via WiFi
    @param data : JSON payload to send
    @param _pin : pin number of the sensor as configured in the API
    @param host : host name of the server
    @param url : url path to send the data
    @return: true if data is sent successfully, false otherwise
**/
bool sendDataViaWiFi(const char *data, const int _pin, const char *host, const char *url)
{
    if (!DeviceConfigState.wifiConnected || !DeviceConfigState.wifiInternetAvailable)
    {
        Serial.println("WiFi not connected or no internet available");
        return false;
    }

    WiFiClient client;
    char pin[4];
    itoa(_pin, pin, 10);

    // Build HTTP request
    char http_headers[3][40] = {};
    strcat(http_headers[0], "X-PIN: ");
    strcat(http_headers[0], pin);

    strcat(http_headers[1], "X-Sensor: ");
    strcat(http_headers[1], SENSOR_PREFIX);
    strcat(http_headers[1], esp_chipid);
    strcat(http_headers[2], "Content-Type: application/json");

    // Connect to server
    if (!client.connect(host, PORT_CFA))
    {
        Serial.println("WiFi: Failed to connect to server");
        return false;
    }

    // Build HTTP POST request
    String http_request = "POST ";
    http_request += url;
    http_request += " HTTP/1.1\r\n";
    http_request += "Host: ";
    http_request += host;
    http_request += "\r\n";
    http_request += "Content-Length: ";
    http_request += strlen(data);
    http_request += "\r\n";
    http_request += http_headers[0]; // X-PIN
    http_request += "\r\n";
    http_request += http_headers[1]; // X-Sensor
    http_request += "\r\n";
    http_request += http_headers[2]; // Content-Type
    http_request += "\r\n";
    http_request += "Connection: close\r\n";
    http_request += "\r\n";
    http_request += data;

    // Send the request
    client.print(http_request);

    // Wait for response and check status code
    unsigned long timeout = millis() + 10000; // 10 second timeout
    uint8_t statuscode = 0;
    bool parsing_status = false;

    while (client.connected() && millis() < timeout)
    {
        String line = client.readStringUntil('\n');
        if (line.length() == 0)
            break;

        // Parse HTTP status code (first line: HTTP/1.1 200 OK)
        if (!parsing_status && line.startsWith("HTTP/1."))
        {
            int space_pos = line.indexOf(' ');
            if (space_pos > 0)
            {
                String status_str = line.substring(space_pos + 1, space_pos + 4);
                statuscode = status_str.toInt();
                parsing_status = true;
                Serial.print("WiFi: HTTP Status Code: ");
                Serial.println(statuscode);
            }
        }
    }

    client.stop();

    if (statuscode == 200 || statuscode == 201)
    {
        Serial.println("WiFi: Data sent successfully");
        return true;
    }
    else
    {
        Serial.println("WiFi: Data send failed with HTTP status: " + String(statuscode));
        return false;
    }
}

/*****************************************************************
 * send data via GSM                                             *
 *****************************************************************/
/**
    @brief: Send data to the server via GSM/GPRS
    @param data : JSON payload to send
    @param _pin : pin number of the sensor as configured in the API
    @param host : host name of the server
    @param url : url path to send the data
    @return: true if data is sent successfully, false otherwise
**/
bool sendDataViaGSM(const char *data, const int _pin, const char *host, const char *url)
{
    if (!gsm_capable || !GPRS_CONNECTED)
    {
        Serial.println("GSM not capable or GPRS not connected");
        return false;
    }

    char gprs_url[64] = {};
    strcat(gprs_url, host);
    strcat(gprs_url, url);

    char pin[4];
    itoa(_pin, pin, 10);

#ifdef QUECTEL
    uint8_t statuscode = 0;

    char http_headers[3][40] = {};
    strcat(http_headers[0], "X-PIN: ");
    strcat(http_headers[0], pin);

    strcat(http_headers[1], "X-Sensor: ");
    strcat(http_headers[1], SENSOR_PREFIX);
    strcat(http_headers[1], esp_chipid);
    strcat(http_headers[2], "Content-Type: application/json");

    QUECTEL_POST(gprs_url, http_headers, 3, data, strlen(data), statuscode);

    if (statuscode == 200 || statuscode == 201)
    {
        Serial.println("GSM: Data sent successfully");
        return true;
    }
    else
    {
        Serial.println("GSM: Data send failed with HTTP status: " + String(statuscode));
        return false;
    }

    // ToDo: close HTTP session/ PDP context
#else
    return false;
#endif
}

/*****************************************************************
 * send data to rest api with fallback                           *
 *****************************************************************/
/**
    @brief: Send data to the server with communication priority and fallback
    @param data : JSON payload to send
    @param _pin : pin number of the sensor as configured in the API
    @param host : host name of the server
    @param url : url path to send the data
    @return: true if data is sent successfully via any method, false otherwise
    @note: Respects CommunicationPriority order and attempts fallback method if primary fails
**/
bool sendData(const char *data, const int _pin, const char *host, const char *url)
{
    bool send_result = false;

